<template>
	<view class="privacy-page">
	    <view class="header">
	      <text class="title">隐私政策</text>
	    </view>
	    <view class="content">
	      <!-- 这里放置隐私政策的详细文本内容 -->
	      <text>{{privaceData}}</text>
	      <!-- 你可以继续添加更多的文本段落、列表或其他HTML元素来组织内容 -->
	    </view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				privaceData: `发布时间：2025年1月1日
最新更新时间：2025年1月30日
豆豆学App与网站非常重视对您隐私的保护，在您使用本app和网站提供的服务前，请您仔细阅读如下声明。
为了给您提供更准确、更有针对性的服务，本网站可能会以如下方式，使用您提交的个人信息。但会以高度的勤勉义务对待这些信息，在未征得您许可的情况下，不会将这些信息对外公开或向第三方提供。
1.我们如何收集和使用您的个人信息
在您使用豆豆学提供的以下服务或功能过程中，我们将基于以下基本功能收集您的相关必要个人信息。
1)账号注册
您首先需要注册一个账号成为豆豆学的注册用户。当您注册时，您需要向我们提供您本人的手机号码，我们将通过发送短信验证码的方式来验证您的身份是否有效。如果您不提供该信息，不影响您浏览或搜索相关学员单信息。您的手机号码在您没有主动或同意的情况下，不会展示给其他用户。
2)发布信息
当您发布信息时，您需要填写一个手机号码，便于我们的客服及时联系到您。您的手机号码在您没有主动或同意的情况下，不会展示给其他用户。需要您设置您的头像，填写您的姓名、职场人身份、家教经历（起始时间、所带科目、家教结果等）、教育经历（毕业学校、专业、学历、在校时间段、在校经历描述）、资格证书、工作期望（期望城市、课时费、期望家教大概位置）。豆豆学将根据您的以上信息，为您匹配可能合适您的家教单，将您推荐给可能合适的家教需求者。您的个人信息（包括手机号、电子邮箱、微信号）在您没有主动或同意交换的情况下，不会展示给其他用户。
2.cookies等技术的使用
网站使用cookies，以便您能登录我们的服务，并允许设定您特定的服务选项。 运用cookies技术，网站能够为您提供更加周到的个性化服务。通过使用cookies所收集的任何内容均以集合的、匿名的方式进行。 您可以选择接受或拒绝 cookies。您可以通过修改浏览器设置的方式拒绝cookies。如果您选择拒绝cookies，则您可能无法登录或使用依赖于cookies 的服务或功能。
3.保有您的使用记录
当您使用网站的服务时，服务器会自动记录一些信息，包括URL、IP地址、浏览器的类型和使用的语言以及访问日期和时间等。
4.定位功能
在您授权的情况下，App会使用系统定位功能获取您的位置信息，用于如下场景： a.定位到您的城市 b.查找您附近的老师、学生或自习室
5.麦克风
如下场景在您授权的情况下，App会使用系统麦克风： 您在预约家教老师页面，在输入需求时，可以选择文字输入，也可以选择语音输入
6.存储权限
如下场景在您授权的情况下，App会使用系统存储功能： 您在预约家教老师页面，当用户选择语音输入时，录音数据会保存到一个文件中
7.相机
如下场景在您授权的情况下，App会使用相机功能： 发布需求时，可以拍照并上传，这些照片是家教相关的一些成果，比如学生分数提高的照片、学生获奖的照片、老师的作品等等。
8.通讯录
如下场景在您授权的情况下，App会使用通讯录功能： 客服登录后，可以将平台上老师的电话信息同步到手机通讯录中，便于知道来电人信息。接单老师或家长可能通过您电话与您进行联系
9.应用内安装其它应用
如下场景在您授权的情况下，App会安装其它应用： 当App升级后，管理员在后台设置升级信息，用户运行App时会看到升级提示，如果用户同意升级，则会下载并安装新版App
10.用到的第三方sdk
无
11.移动推送相关说明
无
12.个性化推送
为了让用户及时知道一些信息，App使用了个性化推送。App会记录用户的一些非敏感信息，包括用户搜索、浏览记录、使用习惯等，但只会根据用户在平台内的身份推送合适的订单信息或操作的的通知等，App会 心系用户隐私，不会随意违规收集信息，而且时刻注意用户信息安全，您也可以在App的设置中关闭推送功能，路径是我的-更多-个性化推荐。
13.销户(注销帐户)
如果您不再需要本平台的服务，可以注销帐户，方法是在App中依次点击我的---更多---销户，后台将清除你的相关注册信息、成单信息、接单信息等等。
14.开发者联系信息
如果您对本个人信息保护政策有任何疑问、意见或建议，请通过doudouxue@163.com与我们联系
在如下情况下，网站会遵照您的意愿或法律的规定披露您的个人信息，由此引发的问题将由您个人承担：
事先获得您的授权；
只有透露你的个人资料，才能提供你所要求的产品和服务；
根据有关的法律法规要求；
按照相关政府主管部门的要求；
为维护网站的合法权益。
您同意让第三方共享资料。
我们发现您违反了网站服务条款或任何其他产品服务的使用规定。
我们需要向代表我们提供产品或服务的公司提供资料（除非我们另行通知你，否则这些公司无权使用你的身份识别资料）。
隐私权政策的修订： 网站时常会对隐私权政策进行修改。如果在使用用户个人信息政策方面有修改时，我们会在网页中显著的位置发布相关规定以便及时通知用户。 问题与建议： 如果您还有其他问题和建议，请告知我们。 本网站会始终致力于在充分保护您隐私的前提下，为您提供更优质的体验和服务。`,
			}
		},
		methods: {
			
		}
	}
</script>

<style>
	.privacy-page {
	  padding: 20px;
	}
	
	.header {
	  text-align: center;
	  margin-bottom: 20px;
	}
	
	.title {
	  font-size: 24px;
	  font-weight: bold;
	}
	
	.content {
	  font-size: 16px;
	  line-height: 1.5;
	}

</style>
