<template>
	<view class="privacy-page">
	    <view class="header">
	      <text class="title">《服务协议》</text>
	    </view>
	    <view class="content">
	      <!-- 这里放置隐私政策的详细文本内容 -->
	      <text>{{privaceData}}</text>
	      <!-- 你可以继续添加更多的文本段落、列表或其他HTML元素来组织内容 -->
	    </view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				privaceData: `特别提示：
《服务协议》（下称“本协议”）由豆豆学（下称“豆豆学”）和您共同签订，具有合同法律效力。本协议未涉及事宜，以您与豆豆学同意和/或确认的《隐私权政策》或其他相关注册协议为准，所有条款与规则为本协议不可分割的组成部分，与本协议具有同等法律效力。
在使用豆豆学教学信息系统服务及豆豆学为您提供的其他服务（下称“本服务”）前，您应当认真阅读并遵守本协议。豆豆学教学信息系统服务包含有：互联网教学信息发布与系统内部信息搜索、系统内部教学信息交互、下单、退课、监督、提现、三方支付等服务。关涉互联网教学信息发布与系统内部信息搜索、系统内部信息交互，由本协议约束执行；关涉第三方支付方式（包括但不限于微信支付、支付宝支付、银联支付、招行超级网银支付及其他支付方式），由本协议约束执行，本协议若与第三方支付、服务提供公司（如深圳市腾讯计算机系统有限公司《微信支付服务协议》相冲突，以本协议为准。关于第三方支付、服务提供公司相关协议、规则您可通过该公司详细咨询、查阅。
请您务必审慎阅读并充分理解各条款内容，特别是免除或者限制责任的条款、争议解决和法律适用条款。免除或者限制责任的条款可能以加粗字体显示，您应重点阅读。如您对本声明有任何疑问、不理解、不认同，都应立即终止签署《服务协议》。
 
一、声明与承诺
1.您确认，在您注册和/或登录成为豆豆学教学信息系统用户接受服务之前，您已充分阅读、理解并接受本协议的全部内容，一旦您按照提示完成输入并点击“同意”和/或“登录”按钮即表示您同意遵循本协议之所有约定，否则您无权使用本服务。
2.您同意，豆豆学有权随时对本协议内容进行单方面的变更，并以在APP、网页上更新的形式进行通知，变更后的协议内容在APP上更新即有效代替原来的协议，同时亦会提醒您阅读并重新签署，您须注意在APP上审阅更新的法律文书。如果您不同意豆豆学对本协议所作的任何变更，您应立即停止使用豆豆学教学信息系统提供的服务。若您在本协议内容公告变更后继续点击“同意”按钮和/或登录和/或注册并使用豆豆学教学信息系统提供的服务，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务。
3.您声明，在您同意接受本协议并注册成为豆豆学教学信息系统用户时，您是具有完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；若您为未成年人，您的父母或监护人应阅读本协议，您应在征得您父母或监护人同意前提下，使用我们的服务或提供您的信息。本协议内容不受您所属国家或地区的排斥。不具备前述条件的，您应立即终止签署。
4.您知悉，您应依照本协议的要求，若您与您通过豆豆学教学系统选中的老师和/或豆豆学系统推荐给您的老师发生民事权利义务关系前，已有签署生效的书面和/或口头协议（以下简称“协议”）或达成的书面和/或口头要约与承诺（以下简称“要约与承诺”），您应自行保存已签署生效的书面协议和/或书面要约与承诺的载体，您也可转交豆豆学为您保存备档；若要约与承诺是口头达成，您应注意保存口头内容的证明材料，如录音等，您也可转交豆豆学为您就证明材料保存备档。
5.您确认，您已经按照豆豆学的提醒，充分了解并注意了本协议中免除和限制豆豆学的责任，可能加重您责任或排除您权利的条款。
6.您承诺，保证您向豆豆学提供的资料及信息的真实性，若因您提供虚假材料或信息，您将承担可能因此产生的所有不利后果。
7.您知悉，您应合理使用豆豆学所提供的所有服务，不得利用该服务进行盈利或非法获利，不得在未经豆豆学书面许可的情况下以任何形式转让或转移您所享有的服务或权益，不得以任何方式将豆豆学服务权益出借于他人使用。若豆豆学有合理理由怀疑您存在任何不当使用豆豆学所提供服务行为，豆豆学有权取消、终止为您提供服务及相应权益资格，若您的行为给豆豆学造成损失的，豆豆学有权向您进行追偿。
 
二、定义
如无特别说明，下列术语在本协议中定义为：
1.豆豆学网站：指豆豆学旗下的任何网站，以及后续可能开通的其他网站。
2.本服务的提供者：指豆豆学。
3.关联公司：豆豆学的关联公司是指由豆豆学直接控制或间接控制；或直接或间接控制豆豆学；或与豆豆学共同控制同一家公司或能对其施加重大影响；或与豆豆学受同一家公司直接或间接控制的公司。这里的“公司”指任何一人公司、有限责任公司或股份有限公司；“控制”是指直接或间接地拥有影响所提及公司管理的能力，无论是通过所有权、有投票权的股份、合同或其他被人民法院认定的方式。
4.豆豆学家教：指豆豆学提供的跨平台教学信息交互的交易、教学督导工具，支持个人、企业参与，由关系链拓展工具、便捷工具、微信订阅号、服务号开放平台等软件系统和服务组成。
5.豆豆学课堂：指豆豆学向您提供的用来查询、发布教学信息、在线视频教学等主功能和服务及拓展其他功能和服务的软件系统。
6.豆豆学教学信息系统：指豆豆学向您提供的用来查询、发布教学信息，与豆豆学客服线上沟通互动及链接第三方支付或其他服务的的APP客户端/软件、豆豆学课堂、在线旁听、豆豆学网站等系统共同组成，并围绕教学信息的查询、发布、在线视频教学督导的主功能拓展其他功能的互联网技术服务平台（以下称“本系统”）。
7.用户信息：包括但不限于用户上传的信息、豆豆学自动接收及合法收集的个人信息及商业信息等；商业信息包括但不限于您与用户之间的交易单号、交易凭证、资金流水、您交于豆豆学备档的交易双方的要约证明、承诺证明或合同等交易信息。
8.个人信息：指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。
9.个人敏感信息：包括身份证件号码、个人生物识别信息、银行账号、财产信息、行踪轨迹、交易信息、14岁以下（含）儿童的个人信息等。
10.课时订单：是指用户在本系统上根据自身需求自行匹配达成的老师用户与家长/学生用户之间的服务协议。
11.订单成立：是指订单在学生/家长通过本系统支付课时费用或学生/家长通过本系统联系到能够提供服务的老师并商定授课时间、地点、方式等服务信息时成立。
12.第三方支付服务：指第三方支付公司（包括但不限于微信、支付宝、银联、招行网银等）依托其平台为收付款人之间提供的货币资金转移服务。
13.分期服务：指与豆豆学合作的服务商依托支付平台为收付款人之间提供的货币资金转移服务和您依约履行还款的总称。
14.用户：通过本系统发生关注教学信息、发布教学信息、搜索教学信息等行为的自然人或单位。
15.充值：是指用户在本系统接入的微信支付服务、支付宝支付、银联支付服务功能，向豆豆学账号上转入并应用于结算的交易金额的行为。
16.提现：是指用户在本系统接入的微信支付服务、支付宝支付、招行超级网银支付服务功能或豆豆学教学信息系统，向豆豆学提出转出并应用于结算的交易金额的行为。
17.教育：豆豆学是合法存续及经营的法人主体，豆豆学与您签订的法律文书中涉及教育的，豆豆学为您提供的互联网教育信息服务中涉及教育的，教育的含义是指：是国民经济行业中的一种，具体是指《国民经济行业分类》（中华人民共和国国家标准GB/T4754—2017代替标准GB/T4754—2011）中6429互联网其他信息服务（即互联网教育信息服务）的种类。
 
三、豆豆学家教服务
1.豆豆学职责：
1.1 豆豆学负责本系统的建设、运行和管理，并确保该系统的安全性；
1.2 豆豆学负责搭建教学信息发布、搜索、交互的平台；
1.3豆豆学负责监督您与您所选择老师之间达成并依约履行教学服务协议（课时订单）；
1.4 豆豆学负责为您提供互联网教育信息服务；
1.5 其他由法律规定或豆豆学发布的法律文书约定由豆豆学提供的服务。
2.服务限制：
2.1所有非依已有签订协议、豆豆学公布的管理规则、通知等进行的非法的使用行为，豆豆学一经发现，有权无条件限制或单方终止您使用本系统。
2.2同时您的充值金额将会受到深圳市腾讯计算机系统有限公司微信支付、支付宝（中国）网络科技有限公司支付宝支付单笔交易限额的限制。
3.关于结算：
3.1您与老师即将签署的协议和/或要约与承诺的结算对价由法律文书约定或豆豆学发布的其他文书规定，并由您自主决定选择适合自身的结算对价；
3.2交易结算依照的法律文书或豆豆学发布的其他文书规定的交易规则由豆豆学制定并监督执行；
3.3 结算对价由豆豆学代为暂收，豆豆学不向您收取任何服务佣金；
3.4您就老师在协议和/或要约与承诺中的未履行义务、未完全履行义务部分的对价金额，可随时向豆豆学申请退还，豆豆学暂不对申请退款收取任何费用；
3.5若您所选择使用的增值服务或产品有特别规则或约定，按该规定或约定执行。
4.选择老师：
您可自主决定选择适合自身的授课老师，关于老师授课的法律文书或豆豆学发布的其他文书规定的授课规则、注意事项由豆豆学制定并监督执行。若您认为需要更换授课老师，可随时在豆豆学平台进行申请。
 
四、双方权利义务及法律责任
1．用户
1.1登陆、使用：用户在使用本系统过程中，通过注册、登录、录入、发布、修改、交易等功能所提交的个人信息、公司信息或交易信息必须保证准确性、真实性、完整性。用户应保证其信息的合法性，并对其产生的一切投诉和纠纷，独立承担法律责任。
1.2账号使用：注册成功的账号及密码，仅限于本人使用，不得以出租、转让、赠送等方式给第三方使用，由于您以出租、转让、赠送等方式给第三方使用，而造成一切投诉和纠纷及信息泄漏后果，均由用户自身承担，同时您应知晓交由他人使用的行为可能会对您本人在权益使用上产生不良影响。
1.3要约与承诺：您与老师之间为合同民事法律关系，即老师与您依照双方签署生效的协议或已达成的要约与承诺享有权益并承担义务的法律关系。您与老师之间课时订单的达成或双方约定线下内容、时间、地点等的行为，视为对对方的要约和承诺，达成要约和承诺后您应完全履行约定义务并独立承担法律责任，您亦应对法律文书约定、协议和要约与承诺之外的行为独立负责。
1.4真实交易背景：您承诺发起的本服务交易基于真实的交易，不得利用本服务从事虚假交易。豆豆学在获知虚假交易行为时，有权依法依约采取措施，该措施包括但不限于发出纠错通知、批评、删除信息、中止和/或终止使用、冻结账号、注销账号等，若因该行为造成豆豆学任何损失，豆豆学有权进行追索。
1.5保存订单及其它单据信息：您应保证订单信息的合法性、真实性、准确性和完整性。除本系统应有的保存外，您应自行通过其他渠道保存其订单信息。
1.6费用结算：您需要依照本系统的操作顺序完成交易费用的结算。
1.7个人行为：豆豆学平台仅作为教学信息发布、搜索、交互的平台，豆豆学监督用户之间达成并依约履行相互教学服务协议—课时订单、负责为用户提供互联网教育信息服务。任何老师（用户）与家长/学生（用户）间或与任何第三人间的借贷行为、违约行为、侵权行为、违法行为均为用户个人行为，与豆豆学无关。同时豆豆学在获知上述行为时，有权依法依约采取措施，该措施包括但不限于发出纠错通知、批评、删除信息、中止和/或终止使用、冻结账号、注销账号等。
1.8监督：豆豆学与您依照法律文书互为监督主体。各方对他方就法律文书的未履行、未完全履行、违法履行，有权告知、要求纠正及随时利用公权力进行救济。
2.豆豆学
2.1用户信息的提取与保存：本系统注册、登陆及交易全过程中，除充值、支付、分期等由第三方服务商借助本系统向您提供的产品外，豆豆学负责提取、必要验证及保存您的个人信息。
2.2法律关系：豆豆学与您之间为合同民事法律关系，即豆豆学与您应依照签署生效的法律文书享有权益并承担义务的法律关系。
2.3行为监督：豆豆学享有对本协议约定服务的监督、提示、检查、纠正等权利。豆豆学有权删除或屏蔽您上传的非法及侵权信息。
2.4支付指令的第三方校验：通过微信支付服务、支付宝支付服务、银联支付服务、分期产品服务完成充值、支付或分期的您在本系统上使用微信支付、支付宝支付、银联支付服务、分期产品服务功能提交的有关支付指令校验的账号、支付密码等信息，均由微信支付功能、支付宝支付、银联支付、分期产品服务功能的开发者、运营者、管理者验证，验证通过，豆豆学即视为本人操作。
2.5交易纠纷：您于本系统中提交完充值或支付指令后，豆豆学的微信账户、支付宝账户、对公账号实收充值款项前，即交易货币资金在支付指令提交后的转移过程中发生的任何风险，与豆豆学无关。但是，因为本系统故障引起的资金转移纠纷除外。
2.6延迟充值：您充值完毕，以豆豆学账户收到账款为完成标准。您虽然在本系统中使用微信支付功能、支付宝支付功能、银联支付功能提交完支付指令，但是豆豆学账户并未收到相关账款，您或豆豆学均有权向深圳市腾讯计算机系统有限公司或支付宝（中国）网络科技有限公司或中国银联股份有限公司行使债权。
2.7必要配合：因您与老师或您与豆豆学存在纠纷和/或违法行为，应公权力机关调查取证之要求，豆豆学将依法完全配合。
 
五、注意义务特别提示
1.信息上传：您上传本系统的信息不得含有以下内容：
1.1反对宪法确定的基本原则的；
1.2危害国家统一、主权和领土完整的；
1.3泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；
1.4煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；
1.5宣扬邪教、迷信的；
1.6扰乱社会秩序，破坏社会稳定的；
1.7诱导未成年人违法犯罪和渲染暴力、色情、赌博、恐怖活动的；
1.8侮辱或者诽谤他人，侵害公民个人隐私等他人合法权益的；
1.9危害社会公德，损害民族优秀文化传统的；
1.10有关法律、行政法规和国家规定禁止的其他内容。
2.安全：
2.1豆豆学建议您与老师协议和/或要约与承诺的履行地点为除老师与学生外的第三人易于查看的接触到的能直接进入的非封闭式的环境。
2.2若老师与您的协议和/或要约与承诺的履行地是私有产权的房屋、协议和/或要约与承诺的履行方式为面对面教学，老师、家长、房屋产权人和/或产权人的代理人（若有），应依法对学生的人身、财产安全共同负责或由老师、家长、房屋产权人和/或产权人的代理人（若有）约定负责，若相关约定与法律规定冲突，以法律规定为准。
2.3您可要求老师在履行与您的协议和/或要约与承诺过程中开启在线旁听功能。
 
六、知识产权
1.软件使用:
您需要下载豆豆学提供的手机/pad软件并安装后方得以从客户端使用豆豆学所提供的服务。豆豆学在此授予客户免费的、不可转让的、非独占的全球性个人许可，允许客户使用由豆豆学提供的、包含在服务中的软件。但是，客户不得复制、修改、发布、出售或出租豆豆学的服务软件或所含软件的任何部分，也不得进行反向工程或试图提取该软件的源代码，不得以任何形式创造相关衍生作品。若发生侵权纠纷，当事人可采取协商、仲裁、行政申诉、诉讼的方式解决。
2.版权:
豆豆学所包含或提供的所有内容诸如文字、图片、视频、声音文件片段、数字下载、软件等都是豆豆学、豆豆学关联公司或其内容提供者的财产，受中国和国际版权法的保护。未经豆豆学书面许可，不得以任何形式通过任何方式复制、展示、修改、转让、分发、重新发布、下载、张贴或传输本网站的内容。若发生侵权纠纷，当事人可采取协商、仲裁、行政申诉、诉讼的方式解决。
3.企业标识:
本应用服务提供的包括但不限于图标、标识、网页页眉、按钮图标、文字等均为豆豆学家教独有的合法企业标识。您未经豆豆学家教书面许可不得擅自使用，不得以任何方式或理由对本网站的标识的任何部分进行使用、复制、修改、传播或与其他产品捆绑使用，不得以任何可能引起消费者混淆的方式或任何诋毁或诽谤豆豆学的方式用于任何商品或服务上。未经豆豆学的书面许可，本应用上的任何内容都不应被解释为以默许或其他方式授予许可或使用本应用上出现的标识的权利。若发生侵权纠纷，当事人可采取协商、仲裁、行政申诉、诉讼的方式解决。

七、免责条款
豆豆学将勤勉尽责审查用户发布的信息。但提供信息的准确性、有效性、完整性、真实性、合法性等由信息提供者承担相关法律责任。豆豆学一旦发现您的行为、您提供的信息违反法律法规、国家标准，违反您与豆豆学签署的协议、豆豆学发布的管理规则等，豆豆学有权依法依约采取措施，该措施包括但不限于发出纠错通知、批评、删除信息、中止和/或终止使用、注销账号等。若法律、您与豆豆学签署的协议、豆豆学发布的管理规则等未有规定和/或约定豆豆学有权采取的措施，豆豆学有权为了豆豆学、豆豆学关联公司、豆豆学用户或公共利益的考虑，临时采取保全措施，该保全措施包括但不限于发出纠错通知、批评、删除信息、中止使用和/或终止等，同时豆豆学会另行告知您豆豆学采取的措施，您认同，豆豆学可以免责。如发生以下情况，豆豆学不对用户的直接或间接损失承担法律责任：因受不可抗力影响而不能履行或不能完全履行本协议的一方可以免除责任。不可抗力是指本协议各方不能预见、不能避免、不能克服的客观情况。此外，鉴于网络之特殊属性，发生包括但不限于下列任何情形导致豆豆学不能履行本协议以下义务的，豆豆学可以免责：
1.黑客攻击、计算机病毒侵入或发作；
2.计算机系统遭到破坏、瘫痪或无法正常使用而导致信息或纪录的丢失、豆豆学不能提供本协议项下之服务的；
3.电信部门技术调整导致之重大影响的；
4.因政府管制而造成服务终止的；
5.其它非豆豆学原因包括但不限于用户将个人注册账号信息告知他人或与他人共享注册帐号、老师（用户）与家长/学生（用户）间或与任何第三人间的违约行为、侵权行为、违法行为等造成的。
 
八、服务终止
您在使用豆豆学服务的过程中，具有下列情形时，豆豆学有权终止对您的服务：
1.您以非法目的使用本系统的；
2.您不以包括但不限于约课、上课的真实交易为目的使用本系统的；
3.您有多次被投诉、举报等不良记录的；
4.您的行为侵犯豆豆学、豆豆学关联公司、豆豆学其他用户、公共利益等的合法权益的；
5.您违反与豆豆学签署的协议、豆豆学公布的管理规则或违反法律法规等的。
 
九、隐私声明
1.除本协议另有约定外，未经一方书面同意，任何一方不得将本协议内容、用户个人信息、用户支付信息等透露给第三方。各方对在履行协议中获得的商业机密和技术秘密负保密责任。各方保证其雇员及代理人履行本条的保密义务。出现下列任一情况时，豆豆学有权披露您的相关商业信息、个人信息：
1.1人民银行或银监会、证监会、保监会等金融业监管机构要求豆豆学提供您的相关商业信息、个人信息的；
1.2公安机关、人民法院、人民检察院或有权行政机关要求豆豆学提供您的相关商业信息、个人信息的；
1.3用户投诉，要求豆豆学提供您的相关商业信息，经豆豆学查实后认为可以提供的。
2.我们对您的信息承担保密义务，但会在下列情况下才将您的信息与第三方共享：
2.1事先获得您的同意或授权；
2.2根据法律法规的规定、行政或司法机构的要求；
2.3向豆豆学的关联方分享您的个人信息；
2.4向可信赖的合作伙伴提供您的个人信息，让他们根据我们的指示并遵循我们的隐私权政策以及其他任何相应的保密和安全措施来为我们处理这些信息。
3.上述保密义务在本协议终止后永续有效。
4.用户信息的保护：
4.1用户的账户均有安全保护功能，请妥善保管账户及密码信息。豆豆学将通过服务器数据备份，确认技术上以实现安全的对用户密码进行加密等措施确保用户信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请用户注意在信息网络上不存在“绝对的安全措施”。
4.2豆豆学含有到其他网站的链接，豆豆学不对那些网站的隐私保护措施负责。当用户登录那些网站时，请提高警惕，保护个人隐私。隐私权政策豆豆学的隐私权政策规定，详细见《隐私权政策》，若本协议中隐私声明与《隐私权政策》有冲突，以《隐私权政策》为准。
 
十、法律适用与争议解决
1．本协议之解释、适用、争议解决等一切事宜，均适用中华人民共和国大陆法律。
2．豆豆学与用户之间的任何争议应友好协商解决，协商不成的，任一方应将争议提交人民法院诉讼解决，除本协议其他条款及法律法规另有规定外。
 
十一、系统消息
豆豆学将通过在应用上发布系统消息或其他方式与用户进行联系。用户同意豆豆学用系统消息方式接收所有协议、通知、披露和其他信息。
 
十二、协议生效
1.本协议自豆豆学公布后对豆豆学生效；
2.本政策自您依照提示点击“同意”和/或“注册”和/或“登录”和/或“预约”后，即您签署后，对您发生法律约束力；
3.豆豆学在法律范围内对本协议拥有解释权。`,
			}
		},
		methods: {
			
		}
	}
</script>

<style>
	.privacy-page {
	  padding: 20px;
	}
	
	.header {
	  text-align: center;
	  margin-bottom: 20px;
	}
	
	.title {
	  font-size: 24px;
	  font-weight: bold;
	}
	
	.content {
	  font-size: 16px;
	  line-height: 1.5;
	}

</style>
